# Taking SQL query results and exporting the Data into Excel
This Python notebook is to create excel files out of SQL query results that can be imported into Tableau.

## Connect to Google Drive (if needed)
If you're working on a project like this using Google Drive (like I am) than it is necessary to for your Python Notebook to have access to your Drive account to edit/modify using the code below:

In [16]:
from google.colab import drive
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

## Import the necessary modules

To execute SQL queries in this notebook, I need 3 modules in Python to read the results of the SQL queries. They are:

...

In [1]:
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

## Connecting to the `COVID_DB` database

We'll need a connection to the `COVID_DB` database using an engine. An engine in this case is: an abstraction of the database. It needs to be created using SQLAlchemy's `create_engine` method in Python. I'll name this instance as `my_conn` for "my connection".

If I'm using my Google Drive Account:

In [2]:
my_conn = create_engine("sqlite:////content/drive/MyDrive/Documents/Data Analysis Projects/Tableau Project for COVID/COVID_DB.db")

If I'm using your own computer:

In [9]:
my_conn = create_engine(r"sqlite:///C:\Users\jcwol\Google Drive\Documents\Data Analysis Projects\Tableau Project for COVID/COVID_DB.db")

## The necessary Query results for Tableau

#### The total amount of death in all COVID-19 cases globally.

In [25]:
sql_query = '''
Select SUM(new_cases) as total_cases, SUM(cast(new_deaths as int)) as total_deaths, SUM(cast(new_deaths as int))/SUM(New_Cases)*100 as DeathPercentage
From CovidDeaths
where continent is not null 
order by 1,2
'''

In [26]:
sql_df = pd.read_sql_query(sql_query, my_conn)

In [27]:
sql_df

   total_cases  total_deaths  DeathPercentage
0  361843043.0       5601157         1.547952

Let's convert result into `Tableau_Tbl1.xlsx`

In [28]:
with pd.ExcelWriter("Tableau_Tbl1.xlsx") as Writer:
  sql_df.to_excel(Writer, index=False)

#### Total Death count from COVID based on Continent location and not including location with names like "income" in it.

In [29]:
sql_query = '''
Select location, SUM(cast(new_deaths as int)) as TotalDeathCount
From CovidDeaths
Where continent is null 
and location not in ('World', 'European Union', 'International')
and location not like '%income%'
Group by location
order by TotalDeathCount desc
'''

In [30]:
sql_df = pd.read_sql_query(sql_query, my_conn)

In [31]:
sql_df

        location  TotalDeathCount
0         Europe          1605667
1           Asia          1281118
2  North America          1276745
3  South America          1195692
4         Africa           236176
5        Oceania             5759

Let's convert result into `Tableau_Tbl2.xlsx`

In [32]:
with pd.ExcelWriter("Tableau_Tbl2.xlsx") as Writer:
  sql_df.to_excel(Writer, index=False)

#### The Infection Rate of each Country

In [33]:
sql_query = '''
Select Location, Population, MAX(total_cases) as HighestInfectionCount,  Max((total_cases/population))*100 as PercentPopulationInfected
From CovidDeaths
Group by Location, Population
order by PercentPopulationInfected desc
'''

In [34]:
sql_df = pd.read_sql_query(sql_query, my_conn)

In [35]:
sql_df

,location,population,HighestInfectionCount,PercentPopulationInfected
0,Andorra,77354.0,35028.0,45.282726
1,Gibraltar,33691.0,12277.0,36.439999
2,Seychelles,98910.0,35606.0,35.998382
3,San Marino,34010.0,11995.0,35.269039
4,Montenegro,628051.0,215950.0,34.384150
...,...,...,...,...
233,Pitcairn,47.0,NaN,NaN
234,Sint Maarten (Dutch part),43421.0,NaN,NaN
235,Tokelau,1368.0,NaN,NaN
236,Turkmenistan,6117933.0,NaN,NaN
237,Tuvalu,11925.0,NaN,NaN

Let's convert result into `Tableau_Tbl3.xlsx`

In [36]:
with pd.ExcelWriter("Tableau_Tbl3.xlsx") as Writer:
  sql_df.to_excel(Writer, index=False)

#### Placeholder...

In [39]:
sql_query = '''
Select Location, Population,date, MAX(total_cases) as HighestInfectionCount,  Max((total_cases/population))*100 as PercentPopulationInfected
From CovidDeaths
Group by Location, Population, date
order by PercentPopulationInfected desc
'''

In [40]:
sql_df = pd.read_sql_query(sql_query, my_conn)

In [41]:
sql_df

,location,population,date,HighestInfectionCount,PercentPopulationInfected
0,Andorra,77354.0,2022-01-26,35028.0,45.282726
1,Andorra,77354.0,2022-01-25,34701.0,44.859994
2,Andorra,77354.0,2022-01-21,33025.0,42.693332
3,Andorra,77354.0,2022-01-22,33025.0,42.693332
4,Andorra,77354.0,2022-01-23,33025.0,42.693332
...,...,...,...,...,...
157471,Tuvalu,11925.0,2021-10-18,NaN,NaN
157472,Tuvalu,11925.0,2021-10-19,NaN,NaN
157473,Tuvalu,11925.0,2021-10-20,NaN,NaN
157474,Tuvalu,11925.0,2021-10-21,NaN,NaN
157475,Tuvalu,11925.0,2021-10-22,NaN,NaN

Let's convert result into `Tableau_Tbl4.xlsx`

In [42]:
with pd.ExcelWriter("Tableau_Tbl4.xlsx") as Writer:
  sql_df.to_excel(Writer, index=False)